EventAdmin/app/controllers/event_admin_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("title", "description", "init_date", "cost", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @event = Event.find(params[:id])

    if @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
UPDATE "events" SET "cost" = $1, "location" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["cost", 150.0], ["location", "Colima"], ["updated_at", "2023-07-03 23:46:37.241316"], ["id", 63]]

  def destroy
    @event = event_find

    if @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 69]]

  def event_find
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]