EventAdmin/app/views/event_admin/index.html.erb

        <div class="card-content">
          <%= image_tag event.image, class: "event-image" unless event.image.blank? %>
---
SELECT "events".* FROM "events"